app/views/posts/index.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
							%i.fa.fa-comments-o
							= post.comments.count